7767517
317 336
pnnx.Input               pnnx_input_0             0 1 0 #0=(1,3,416,416)f32
nn.Conv2d                convbn2d_0               1 1 0 1 bias=True dilation=(1,1) groups=1 in_channels=3 kernel_size=(3,3) out_channels=32 padding=(1,1) padding_mode=zeros stride=(2,2) @bias=(32)f32 @weight=(32,3,3,3)f32 $input=0 #0=(1,3,416,416)f32 #1=(1,32,208,208)f32
nn.ReLU                  model.0.conv.2           1 1 1 2 #1=(1,32,208,208)f32 #2=(1,32,208,208)f32
nn.MaxPool2d             model.0.maxpool          1 1 2 3 ceil_mode=False dilation=(1,1) kernel_size=(3,3) padding=(1,1) return_indices=False stride=(2,2) #2=(1,32,208,208)f32 #3=(1,32,104,104)f32
nn.Conv2d                convbn2d_1               1 1 3 4 bias=True dilation=(1,1) groups=32 in_channels=32 kernel_size=(3,3) out_channels=32 padding=(1,1) padding_mode=zeros stride=(2,2) @bias=(32)f32 @weight=(32,1,3,3)f32 $input=3 #3=(1,32,104,104)f32 #4=(1,32,52,52)f32
nn.Conv2d                convbn2d_2               1 1 4 5 bias=True dilation=(1,1) groups=1 in_channels=32 kernel_size=(1,1) out_channels=60 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(60)f32 @weight=(60,32,1,1)f32 $input=4 #4=(1,32,52,52)f32 #5=(1,60,52,52)f32
nn.ReLU                  model.1.branch1.4        1 1 5 6 #5=(1,60,52,52)f32 #6=(1,60,52,52)f32
nn.Conv2d                convbn2d_3               1 1 3 7 bias=True dilation=(1,1) groups=1 in_channels=32 kernel_size=(1,1) out_channels=60 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(60)f32 @weight=(60,32,1,1)f32 $input=3 #3=(1,32,104,104)f32 #7=(1,60,104,104)f32
nn.ReLU                  model.1.branch2.2        1 1 7 8 #7=(1,60,104,104)f32 #8=(1,60,104,104)f32
nn.Conv2d                convbn2d_4               1 1 8 9 bias=True dilation=(1,1) groups=60 in_channels=60 kernel_size=(3,3) out_channels=60 padding=(1,1) padding_mode=zeros stride=(2,2) @bias=(60)f32 @weight=(60,1,3,3)f32 $input=8 #8=(1,60,104,104)f32 #9=(1,60,52,52)f32
nn.Conv2d                convbn2d_5               1 1 9 10 bias=True dilation=(1,1) groups=1 in_channels=60 kernel_size=(1,1) out_channels=60 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(60)f32 @weight=(60,60,1,1)f32 $input=9 #9=(1,60,52,52)f32 #10=(1,60,52,52)f32
nn.ReLU                  model.1.branch2.7        1 1 10 11 #10=(1,60,52,52)f32 #11=(1,60,52,52)f32
torch.cat                torch.cat_143            2 1 6 11 12 dim=1 #6=(1,60,52,52)f32 #11=(1,60,52,52)f32 #12=(1,120,52,52)f32
nn.ChannelShuffle        channelshuffle_0         1 1 12 13 groups=2 $input=12 #12=(1,120,52,52)f32 #13=(1,120,52,52)f32
torch.chunk              torch.chunk_169          1 2 13 14 15 chunks=2 dim=1 $input=13 #13=(1,120,52,52)f32 #14=(1,60,52,52)f32 #15=(1,60,52,52)f32
nn.Conv2d                convbn2d_6               1 1 15 16 bias=True dilation=(1,1) groups=1 in_channels=60 kernel_size=(1,1) out_channels=60 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(60)f32 @weight=(60,60,1,1)f32 $input=15 #15=(1,60,52,52)f32 #16=(1,60,52,52)f32
nn.ReLU                  model.2.0.branch2.2      1 1 16 17 #16=(1,60,52,52)f32 #17=(1,60,52,52)f32
nn.Conv2d                convbn2d_7               1 1 17 18 bias=True dilation=(1,1) groups=60 in_channels=60 kernel_size=(3,3) out_channels=60 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(60)f32 @weight=(60,1,3,3)f32 $input=17 #17=(1,60,52,52)f32 #18=(1,60,52,52)f32
nn.Conv2d                convbn2d_8               1 1 18 19 bias=True dilation=(1,1) groups=1 in_channels=60 kernel_size=(1,1) out_channels=60 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(60)f32 @weight=(60,60,1,1)f32 $input=18 #18=(1,60,52,52)f32 #19=(1,60,52,52)f32
nn.ReLU                  model.2.0.branch2.7      1 1 19 20 #19=(1,60,52,52)f32 #20=(1,60,52,52)f32
torch.cat                torch.cat_144            2 1 14 20 21 dim=1 #14=(1,60,52,52)f32 #20=(1,60,52,52)f32 #21=(1,120,52,52)f32
nn.ChannelShuffle        channelshuffle_1         1 1 21 22 groups=2 $input=21 #21=(1,120,52,52)f32 #22=(1,120,52,52)f32
torch.chunk              torch.chunk_170          1 2 22 23 24 chunks=2 dim=1 $input=22 #22=(1,120,52,52)f32 #23=(1,60,52,52)f32 #24=(1,60,52,52)f32
nn.Conv2d                convbn2d_9               1 1 24 25 bias=True dilation=(1,1) groups=1 in_channels=60 kernel_size=(1,1) out_channels=60 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(60)f32 @weight=(60,60,1,1)f32 $input=24 #24=(1,60,52,52)f32 #25=(1,60,52,52)f32
nn.ReLU                  model.2.1.branch2.2      1 1 25 26 #25=(1,60,52,52)f32 #26=(1,60,52,52)f32
nn.Conv2d                convbn2d_10              1 1 26 27 bias=True dilation=(1,1) groups=60 in_channels=60 kernel_size=(3,3) out_channels=60 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(60)f32 @weight=(60,1,3,3)f32 $input=26 #26=(1,60,52,52)f32 #27=(1,60,52,52)f32
nn.Conv2d                convbn2d_11              1 1 27 28 bias=True dilation=(1,1) groups=1 in_channels=60 kernel_size=(1,1) out_channels=60 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(60)f32 @weight=(60,60,1,1)f32 $input=27 #27=(1,60,52,52)f32 #28=(1,60,52,52)f32
nn.ReLU                  model.2.1.branch2.7      1 1 28 29 #28=(1,60,52,52)f32 #29=(1,60,52,52)f32
torch.cat                torch.cat_145            2 1 23 29 30 dim=1 #23=(1,60,52,52)f32 #29=(1,60,52,52)f32 #30=(1,120,52,52)f32
nn.ChannelShuffle        channelshuffle_2         1 1 30 31 groups=2 $input=30 #30=(1,120,52,52)f32 #31=(1,120,52,52)f32
torch.chunk              torch.chunk_171          1 2 31 32 33 chunks=2 dim=1 $input=31 #31=(1,120,52,52)f32 #32=(1,60,52,52)f32 #33=(1,60,52,52)f32
nn.Conv2d                convbn2d_12              1 1 33 34 bias=True dilation=(1,1) groups=1 in_channels=60 kernel_size=(1,1) out_channels=60 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(60)f32 @weight=(60,60,1,1)f32 $input=33 #33=(1,60,52,52)f32 #34=(1,60,52,52)f32
nn.ReLU                  model.2.2.branch2.2      1 1 34 35 #34=(1,60,52,52)f32 #35=(1,60,52,52)f32
nn.Conv2d                convbn2d_13              1 1 35 36 bias=True dilation=(1,1) groups=60 in_channels=60 kernel_size=(3,3) out_channels=60 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(60)f32 @weight=(60,1,3,3)f32 $input=35 #35=(1,60,52,52)f32 #36=(1,60,52,52)f32
nn.Conv2d                convbn2d_14              1 1 36 37 bias=True dilation=(1,1) groups=1 in_channels=60 kernel_size=(1,1) out_channels=60 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(60)f32 @weight=(60,60,1,1)f32 $input=36 #36=(1,60,52,52)f32 #37=(1,60,52,52)f32
nn.ReLU                  model.2.2.branch2.7      1 1 37 38 #37=(1,60,52,52)f32 #38=(1,60,52,52)f32
torch.cat                torch.cat_146            2 1 32 38 39 dim=1 #32=(1,60,52,52)f32 #38=(1,60,52,52)f32 #39=(1,120,52,52)f32
nn.ChannelShuffle        channelshuffle_3         1 1 39 40 groups=2 $input=39 #39=(1,120,52,52)f32 #40=(1,120,52,52)f32
nn.Conv2d                convbn2d_15              1 1 40 41 bias=True dilation=(1,1) groups=120 in_channels=120 kernel_size=(3,3) out_channels=120 padding=(1,1) padding_mode=zeros stride=(2,2) @bias=(120)f32 @weight=(120,1,3,3)f32 $input=40 #40=(1,120,52,52)f32 #41=(1,120,26,26)f32
nn.Conv2d                convbn2d_16              1 1 41 42 bias=True dilation=(1,1) groups=1 in_channels=120 kernel_size=(1,1) out_channels=116 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(116)f32 @weight=(116,120,1,1)f32 $input=41 #41=(1,120,26,26)f32 #42=(1,116,26,26)f32
nn.ReLU                  model.3.branch1.4        1 1 42 43 #42=(1,116,26,26)f32 #43=(1,116,26,26)f32
nn.Conv2d                convbn2d_17              1 1 40 44 bias=True dilation=(1,1) groups=1 in_channels=120 kernel_size=(1,1) out_channels=116 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(116)f32 @weight=(116,120,1,1)f32 $input=40 #40=(1,120,52,52)f32 #44=(1,116,52,52)f32
nn.ReLU                  model.3.branch2.2        1 1 44 45 #44=(1,116,52,52)f32 #45=(1,116,52,52)f32
nn.Conv2d                convbn2d_18              1 1 45 46 bias=True dilation=(1,1) groups=116 in_channels=116 kernel_size=(3,3) out_channels=116 padding=(1,1) padding_mode=zeros stride=(2,2) @bias=(116)f32 @weight=(116,1,3,3)f32 $input=45 #45=(1,116,52,52)f32 #46=(1,116,26,26)f32
nn.Conv2d                convbn2d_19              1 1 46 47 bias=True dilation=(1,1) groups=1 in_channels=116 kernel_size=(1,1) out_channels=116 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(116)f32 @weight=(116,116,1,1)f32 $input=46 #46=(1,116,26,26)f32 #47=(1,116,26,26)f32
nn.ReLU                  model.3.branch2.7        1 1 47 48 #47=(1,116,26,26)f32 #48=(1,116,26,26)f32
torch.cat                torch.cat_147            2 1 43 48 49 dim=1 #43=(1,116,26,26)f32 #48=(1,116,26,26)f32 #49=(1,232,26,26)f32
nn.ChannelShuffle        channelshuffle_4         1 1 49 50 groups=2 $input=49 #49=(1,232,26,26)f32 #50=(1,232,26,26)f32
torch.chunk              torch.chunk_172          1 2 50 51 52 chunks=2 dim=1 $input=50 #50=(1,232,26,26)f32 #51=(1,116,26,26)f32 #52=(1,116,26,26)f32
nn.Conv2d                convbn2d_20              1 1 52 53 bias=True dilation=(1,1) groups=1 in_channels=116 kernel_size=(1,1) out_channels=116 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(116)f32 @weight=(116,116,1,1)f32 $input=52 #52=(1,116,26,26)f32 #53=(1,116,26,26)f32
nn.ReLU                  model.4.0.branch2.2      1 1 53 54 #53=(1,116,26,26)f32 #54=(1,116,26,26)f32
nn.Conv2d                convbn2d_21              1 1 54 55 bias=True dilation=(1,1) groups=116 in_channels=116 kernel_size=(3,3) out_channels=116 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(116)f32 @weight=(116,1,3,3)f32 $input=54 #54=(1,116,26,26)f32 #55=(1,116,26,26)f32
nn.Conv2d                convbn2d_22              1 1 55 56 bias=True dilation=(1,1) groups=1 in_channels=116 kernel_size=(1,1) out_channels=116 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(116)f32 @weight=(116,116,1,1)f32 $input=55 #55=(1,116,26,26)f32 #56=(1,116,26,26)f32
nn.ReLU                  model.4.0.branch2.7      1 1 56 57 #56=(1,116,26,26)f32 #57=(1,116,26,26)f32
torch.cat                torch.cat_148            2 1 51 57 58 dim=1 #51=(1,116,26,26)f32 #57=(1,116,26,26)f32 #58=(1,232,26,26)f32
nn.ChannelShuffle        channelshuffle_5         1 1 58 59 groups=2 $input=58 #58=(1,232,26,26)f32 #59=(1,232,26,26)f32
torch.chunk              torch.chunk_173          1 2 59 60 61 chunks=2 dim=1 $input=59 #59=(1,232,26,26)f32 #60=(1,116,26,26)f32 #61=(1,116,26,26)f32
nn.Conv2d                convbn2d_23              1 1 61 62 bias=True dilation=(1,1) groups=1 in_channels=116 kernel_size=(1,1) out_channels=116 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(116)f32 @weight=(116,116,1,1)f32 $input=61 #61=(1,116,26,26)f32 #62=(1,116,26,26)f32
nn.ReLU                  model.4.1.branch2.2      1 1 62 63 #62=(1,116,26,26)f32 #63=(1,116,26,26)f32
nn.Conv2d                convbn2d_24              1 1 63 64 bias=True dilation=(1,1) groups=116 in_channels=116 kernel_size=(3,3) out_channels=116 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(116)f32 @weight=(116,1,3,3)f32 $input=63 #63=(1,116,26,26)f32 #64=(1,116,26,26)f32
nn.Conv2d                convbn2d_25              1 1 64 65 bias=True dilation=(1,1) groups=1 in_channels=116 kernel_size=(1,1) out_channels=116 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(116)f32 @weight=(116,116,1,1)f32 $input=64 #64=(1,116,26,26)f32 #65=(1,116,26,26)f32
nn.ReLU                  model.4.1.branch2.7      1 1 65 66 #65=(1,116,26,26)f32 #66=(1,116,26,26)f32
torch.cat                torch.cat_149            2 1 60 66 67 dim=1 #60=(1,116,26,26)f32 #66=(1,116,26,26)f32 #67=(1,232,26,26)f32
nn.ChannelShuffle        channelshuffle_6         1 1 67 68 groups=2 $input=67 #67=(1,232,26,26)f32 #68=(1,232,26,26)f32
torch.chunk              torch.chunk_174          1 2 68 69 70 chunks=2 dim=1 $input=68 #68=(1,232,26,26)f32 #69=(1,116,26,26)f32 #70=(1,116,26,26)f32
nn.Conv2d                convbn2d_26              1 1 70 71 bias=True dilation=(1,1) groups=1 in_channels=116 kernel_size=(1,1) out_channels=116 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(116)f32 @weight=(116,116,1,1)f32 $input=70 #70=(1,116,26,26)f32 #71=(1,116,26,26)f32
nn.ReLU                  model.4.2.branch2.2      1 1 71 72 #71=(1,116,26,26)f32 #72=(1,116,26,26)f32
nn.Conv2d                convbn2d_27              1 1 72 73 bias=True dilation=(1,1) groups=116 in_channels=116 kernel_size=(3,3) out_channels=116 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(116)f32 @weight=(116,1,3,3)f32 $input=72 #72=(1,116,26,26)f32 #73=(1,116,26,26)f32
nn.Conv2d                convbn2d_28              1 1 73 74 bias=True dilation=(1,1) groups=1 in_channels=116 kernel_size=(1,1) out_channels=116 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(116)f32 @weight=(116,116,1,1)f32 $input=73 #73=(1,116,26,26)f32 #74=(1,116,26,26)f32
nn.ReLU                  model.4.2.branch2.7      1 1 74 75 #74=(1,116,26,26)f32 #75=(1,116,26,26)f32
torch.cat                torch.cat_150            2 1 69 75 76 dim=1 #69=(1,116,26,26)f32 #75=(1,116,26,26)f32 #76=(1,232,26,26)f32
nn.ChannelShuffle        channelshuffle_7         1 1 76 77 groups=2 $input=76 #76=(1,232,26,26)f32 #77=(1,232,26,26)f32
torch.chunk              torch.chunk_175          1 2 77 78 79 chunks=2 dim=1 $input=77 #77=(1,232,26,26)f32 #78=(1,116,26,26)f32 #79=(1,116,26,26)f32
nn.Conv2d                convbn2d_29              1 1 79 80 bias=True dilation=(1,1) groups=1 in_channels=116 kernel_size=(1,1) out_channels=116 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(116)f32 @weight=(116,116,1,1)f32 $input=79 #79=(1,116,26,26)f32 #80=(1,116,26,26)f32
nn.ReLU                  model.4.3.branch2.2      1 1 80 81 #80=(1,116,26,26)f32 #81=(1,116,26,26)f32
nn.Conv2d                convbn2d_30              1 1 81 82 bias=True dilation=(1,1) groups=116 in_channels=116 kernel_size=(3,3) out_channels=116 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(116)f32 @weight=(116,1,3,3)f32 $input=81 #81=(1,116,26,26)f32 #82=(1,116,26,26)f32
nn.Conv2d                convbn2d_31              1 1 82 83 bias=True dilation=(1,1) groups=1 in_channels=116 kernel_size=(1,1) out_channels=116 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(116)f32 @weight=(116,116,1,1)f32 $input=82 #82=(1,116,26,26)f32 #83=(1,116,26,26)f32
nn.ReLU                  model.4.3.branch2.7      1 1 83 84 #83=(1,116,26,26)f32 #84=(1,116,26,26)f32
torch.cat                torch.cat_151            2 1 78 84 85 dim=1 #78=(1,116,26,26)f32 #84=(1,116,26,26)f32 #85=(1,232,26,26)f32
nn.ChannelShuffle        channelshuffle_8         1 1 85 86 groups=2 $input=85 #85=(1,232,26,26)f32 #86=(1,232,26,26)f32
torch.chunk              torch.chunk_176          1 2 86 87 88 chunks=2 dim=1 $input=86 #86=(1,232,26,26)f32 #87=(1,116,26,26)f32 #88=(1,116,26,26)f32
nn.Conv2d                convbn2d_32              1 1 88 89 bias=True dilation=(1,1) groups=1 in_channels=116 kernel_size=(1,1) out_channels=116 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(116)f32 @weight=(116,116,1,1)f32 $input=88 #88=(1,116,26,26)f32 #89=(1,116,26,26)f32
nn.ReLU                  model.4.4.branch2.2      1 1 89 90 #89=(1,116,26,26)f32 #90=(1,116,26,26)f32
nn.Conv2d                convbn2d_33              1 1 90 91 bias=True dilation=(1,1) groups=116 in_channels=116 kernel_size=(3,3) out_channels=116 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(116)f32 @weight=(116,1,3,3)f32 $input=90 #90=(1,116,26,26)f32 #91=(1,116,26,26)f32
nn.Conv2d                convbn2d_34              1 1 91 92 bias=True dilation=(1,1) groups=1 in_channels=116 kernel_size=(1,1) out_channels=116 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(116)f32 @weight=(116,116,1,1)f32 $input=91 #91=(1,116,26,26)f32 #92=(1,116,26,26)f32
nn.ReLU                  model.4.4.branch2.7      1 1 92 93 #92=(1,116,26,26)f32 #93=(1,116,26,26)f32
torch.cat                torch.cat_152            2 1 87 93 94 dim=1 #87=(1,116,26,26)f32 #93=(1,116,26,26)f32 #94=(1,232,26,26)f32
nn.ChannelShuffle        channelshuffle_9         1 1 94 95 groups=2 $input=94 #94=(1,232,26,26)f32 #95=(1,232,26,26)f32
torch.chunk              torch.chunk_177          1 2 95 96 97 chunks=2 dim=1 $input=95 #95=(1,232,26,26)f32 #96=(1,116,26,26)f32 #97=(1,116,26,26)f32
nn.Conv2d                convbn2d_35              1 1 97 98 bias=True dilation=(1,1) groups=1 in_channels=116 kernel_size=(1,1) out_channels=116 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(116)f32 @weight=(116,116,1,1)f32 $input=97 #97=(1,116,26,26)f32 #98=(1,116,26,26)f32
nn.ReLU                  model.4.5.branch2.2      1 1 98 99 #98=(1,116,26,26)f32 #99=(1,116,26,26)f32
nn.Conv2d                convbn2d_36              1 1 99 100 bias=True dilation=(1,1) groups=116 in_channels=116 kernel_size=(3,3) out_channels=116 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(116)f32 @weight=(116,1,3,3)f32 $input=99 #99=(1,116,26,26)f32 #100=(1,116,26,26)f32
nn.Conv2d                convbn2d_37              1 1 100 101 bias=True dilation=(1,1) groups=1 in_channels=116 kernel_size=(1,1) out_channels=116 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(116)f32 @weight=(116,116,1,1)f32 $input=100 #100=(1,116,26,26)f32 #101=(1,116,26,26)f32
nn.ReLU                  model.4.5.branch2.7      1 1 101 102 #101=(1,116,26,26)f32 #102=(1,116,26,26)f32
torch.cat                torch.cat_153            2 1 96 102 103 dim=1 #96=(1,116,26,26)f32 #102=(1,116,26,26)f32 #103=(1,232,26,26)f32
nn.ChannelShuffle        channelshuffle_10        1 1 103 104 groups=2 $input=103 #103=(1,232,26,26)f32 #104=(1,232,26,26)f32
torch.chunk              torch.chunk_178          1 2 104 105 106 chunks=2 dim=1 $input=104 #104=(1,232,26,26)f32 #105=(1,116,26,26)f32 #106=(1,116,26,26)f32
nn.Conv2d                convbn2d_38              1 1 106 107 bias=True dilation=(1,1) groups=1 in_channels=116 kernel_size=(1,1) out_channels=116 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(116)f32 @weight=(116,116,1,1)f32 $input=106 #106=(1,116,26,26)f32 #107=(1,116,26,26)f32
nn.ReLU                  model.4.6.branch2.2      1 1 107 108 #107=(1,116,26,26)f32 #108=(1,116,26,26)f32
nn.Conv2d                convbn2d_39              1 1 108 109 bias=True dilation=(1,1) groups=116 in_channels=116 kernel_size=(3,3) out_channels=116 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(116)f32 @weight=(116,1,3,3)f32 $input=108 #108=(1,116,26,26)f32 #109=(1,116,26,26)f32
nn.Conv2d                convbn2d_40              1 1 109 110 bias=True dilation=(1,1) groups=1 in_channels=116 kernel_size=(1,1) out_channels=116 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(116)f32 @weight=(116,116,1,1)f32 $input=109 #109=(1,116,26,26)f32 #110=(1,116,26,26)f32
nn.ReLU                  model.4.6.branch2.7      1 1 110 111 #110=(1,116,26,26)f32 #111=(1,116,26,26)f32
torch.cat                torch.cat_154            2 1 105 111 112 dim=1 #105=(1,116,26,26)f32 #111=(1,116,26,26)f32 #112=(1,232,26,26)f32
nn.ChannelShuffle        channelshuffle_11        1 1 112 113 groups=2 $input=112 #112=(1,232,26,26)f32 #113=(1,232,26,26)f32
nn.Conv2d                convbn2d_41              1 1 113 114 bias=True dilation=(1,1) groups=232 in_channels=232 kernel_size=(3,3) out_channels=232 padding=(1,1) padding_mode=zeros stride=(2,2) @bias=(232)f32 @weight=(232,1,3,3)f32 $input=113 #113=(1,232,26,26)f32 #114=(1,232,13,13)f32
nn.Conv2d                convbn2d_42              1 1 114 115 bias=True dilation=(1,1) groups=1 in_channels=232 kernel_size=(1,1) out_channels=232 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(232)f32 @weight=(232,232,1,1)f32 $input=114 #114=(1,232,13,13)f32 #115=(1,232,13,13)f32
nn.ReLU                  model.5.branch1.4        1 1 115 116 #115=(1,232,13,13)f32 #116=(1,232,13,13)f32
nn.Conv2d                convbn2d_43              1 1 113 117 bias=True dilation=(1,1) groups=1 in_channels=232 kernel_size=(1,1) out_channels=232 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(232)f32 @weight=(232,232,1,1)f32 $input=113 #113=(1,232,26,26)f32 #117=(1,232,26,26)f32
nn.ReLU                  model.5.branch2.2        1 1 117 118 #117=(1,232,26,26)f32 #118=(1,232,26,26)f32
nn.Conv2d                convbn2d_44              1 1 118 119 bias=True dilation=(1,1) groups=232 in_channels=232 kernel_size=(3,3) out_channels=232 padding=(1,1) padding_mode=zeros stride=(2,2) @bias=(232)f32 @weight=(232,1,3,3)f32 $input=118 #118=(1,232,26,26)f32 #119=(1,232,13,13)f32
nn.Conv2d                convbn2d_45              1 1 119 120 bias=True dilation=(1,1) groups=1 in_channels=232 kernel_size=(1,1) out_channels=232 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(232)f32 @weight=(232,232,1,1)f32 $input=119 #119=(1,232,13,13)f32 #120=(1,232,13,13)f32
nn.ReLU                  model.5.branch2.7        1 1 120 121 #120=(1,232,13,13)f32 #121=(1,232,13,13)f32
torch.cat                torch.cat_155            2 1 116 121 122 dim=1 #116=(1,232,13,13)f32 #121=(1,232,13,13)f32 #122=(1,464,13,13)f32
nn.ChannelShuffle        channelshuffle_12        1 1 122 123 groups=2 $input=122 #122=(1,464,13,13)f32 #123=(1,464,13,13)f32
torch.chunk              torch.chunk_179          1 2 123 124 125 chunks=2 dim=1 $input=123 #123=(1,464,13,13)f32 #124=(1,232,13,13)f32 #125=(1,232,13,13)f32
nn.Conv2d                convbn2d_46              1 1 125 126 bias=True dilation=(1,1) groups=1 in_channels=232 kernel_size=(1,1) out_channels=232 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(232)f32 @weight=(232,232,1,1)f32 $input=125 #125=(1,232,13,13)f32 #126=(1,232,13,13)f32
nn.ReLU                  model.6.branch2.2        1 1 126 127 #126=(1,232,13,13)f32 #127=(1,232,13,13)f32
nn.Conv2d                convbn2d_47              1 1 127 128 bias=True dilation=(1,1) groups=232 in_channels=232 kernel_size=(3,3) out_channels=232 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(232)f32 @weight=(232,1,3,3)f32 $input=127 #127=(1,232,13,13)f32 #128=(1,232,13,13)f32
nn.Conv2d                convbn2d_48              1 1 128 129 bias=True dilation=(1,1) groups=1 in_channels=232 kernel_size=(1,1) out_channels=232 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(232)f32 @weight=(232,232,1,1)f32 $input=128 #128=(1,232,13,13)f32 #129=(1,232,13,13)f32
nn.ReLU                  model.6.branch2.7        1 1 129 130 #129=(1,232,13,13)f32 #130=(1,232,13,13)f32
torch.cat                torch.cat_156            2 1 124 130 131 dim=1 #124=(1,232,13,13)f32 #130=(1,232,13,13)f32 #131=(1,464,13,13)f32
nn.ChannelShuffle        channelshuffle_13        1 1 131 132 groups=2 $input=131 #131=(1,464,13,13)f32 #132=(1,464,13,13)f32
nn.Conv2d                model.7.conv             1 1 132 133 bias=True dilation=(1,1) groups=1 in_channels=464 kernel_size=(1,1) out_channels=96 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(96)f32 @weight=(96,464,1,1)f32 #132=(1,464,13,13)f32 #133=(1,96,13,13)f32
F.silu                   F.silu_0                 1 1 133 134 $input=133 #133=(1,96,13,13)f32 #134=(1,96,13,13)f32
nn.Upsample              model.8                  1 1 134 135 mode=nearest scale_factor=(2.000000e+00,2.000000e+00) size=None #134=(1,96,13,13)f32 #135=(1,96,26,26)f32
torch.cat                torch.cat_157            2 1 135 113 136 dim=1 #135=(1,96,26,26)f32 #113=(1,232,26,26)f32 #136=(1,328,26,26)f32
nn.Conv2d                convbn2d_49              1 1 136 137 bias=True dilation=(1,1) groups=328 in_channels=328 kernel_size=(3,3) out_channels=328 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(328)f32 @weight=(328,1,3,3)f32 $input=136 #136=(1,328,26,26)f32 #137=(1,328,26,26)f32
F.relu                   F.relu_2                 1 1 137 138 $input=137 #137=(1,328,26,26)f32 #138=(1,328,26,26)f32
nn.Conv2d                convbn2d_50              1 1 138 139 bias=True dilation=(1,1) groups=1 in_channels=328 kernel_size=(1,1) out_channels=96 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(96)f32 @weight=(96,328,1,1)f32 $input=138 #138=(1,328,26,26)f32 #139=(1,96,26,26)f32
F.relu                   F.relu_3                 1 1 139 140 $input=139 #139=(1,96,26,26)f32 #140=(1,96,26,26)f32
nn.Conv2d                model.11.conv            1 1 140 141 bias=True dilation=(1,1) groups=1 in_channels=96 kernel_size=(1,1) out_channels=96 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(96)f32 @weight=(96,96,1,1)f32 #140=(1,96,26,26)f32 #141=(1,96,26,26)f32
F.silu                   F.silu_1                 1 1 141 142 $input=141 #141=(1,96,26,26)f32 #142=(1,96,26,26)f32
nn.Upsample              model.12                 1 1 142 143 mode=nearest scale_factor=(2.000000e+00,2.000000e+00) size=None #142=(1,96,26,26)f32 #143=(1,96,52,52)f32
torch.cat                torch.cat_158            2 1 143 40 144 dim=1 #143=(1,96,52,52)f32 #40=(1,120,52,52)f32 #144=(1,216,52,52)f32
nn.Conv2d                convbn2d_51              1 1 144 145 bias=True dilation=(1,1) groups=216 in_channels=216 kernel_size=(3,3) out_channels=216 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(216)f32 @weight=(216,1,3,3)f32 $input=144 #144=(1,216,52,52)f32 #145=(1,216,52,52)f32
F.relu                   F.relu_4                 1 1 145 146 $input=145 #145=(1,216,52,52)f32 #146=(1,216,52,52)f32
nn.Conv2d                convbn2d_52              1 1 146 147 bias=True dilation=(1,1) groups=1 in_channels=216 kernel_size=(1,1) out_channels=96 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(96)f32 @weight=(96,216,1,1)f32 $input=146 #146=(1,216,52,52)f32 #147=(1,96,52,52)f32
F.relu                   F.relu_5                 1 1 147 148 $input=147 #147=(1,96,52,52)f32 #148=(1,96,52,52)f32
nn.Conv2d                convbn2d_53              1 1 148 149 bias=True dilation=(1,1) groups=96 in_channels=96 kernel_size=(3,3) out_channels=96 padding=(1,1) padding_mode=zeros stride=(2,2) @bias=(96)f32 @weight=(96,1,3,3)f32 $input=148 #148=(1,96,52,52)f32 #149=(1,96,26,26)f32
F.relu                   F.relu_6                 1 1 149 150 $input=149 #149=(1,96,26,26)f32 #150=(1,96,26,26)f32
nn.Conv2d                convbn2d_54              1 1 150 151 bias=True dilation=(1,1) groups=1 in_channels=96 kernel_size=(1,1) out_channels=96 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(96)f32 @weight=(96,96,1,1)f32 $input=150 #150=(1,96,26,26)f32 #151=(1,96,26,26)f32
F.relu                   F.relu_7                 1 1 151 152 $input=151 #151=(1,96,26,26)f32 #152=(1,96,26,26)f32
BinaryOp                 add_0                    2 1 152 142 153 0=0 #152=(1,96,26,26)f32 #142=(1,96,26,26)f32 #153=(1,96,26,26)f32
nn.Conv2d                convbn2d_55              1 1 153 154 bias=True dilation=(1,1) groups=96 in_channels=96 kernel_size=(3,3) out_channels=96 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(96)f32 @weight=(96,1,3,3)f32 $input=153 #153=(1,96,26,26)f32 #154=(1,96,26,26)f32
F.relu                   F.relu_8                 1 1 154 155 $input=154 #154=(1,96,26,26)f32 #155=(1,96,26,26)f32
nn.Conv2d                convbn2d_56              1 1 155 156 bias=True dilation=(1,1) groups=1 in_channels=96 kernel_size=(1,1) out_channels=96 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(96)f32 @weight=(96,96,1,1)f32 $input=155 #155=(1,96,26,26)f32 #156=(1,96,26,26)f32
F.relu                   F.relu_9                 1 1 156 157 $input=156 #156=(1,96,26,26)f32 #157=(1,96,26,26)f32
nn.Conv2d                convbn2d_57              1 1 157 158 bias=True dilation=(1,1) groups=96 in_channels=96 kernel_size=(3,3) out_channels=96 padding=(1,1) padding_mode=zeros stride=(2,2) @bias=(96)f32 @weight=(96,1,3,3)f32 $input=157 #157=(1,96,26,26)f32 #158=(1,96,13,13)f32
F.relu                   F.relu_10                1 1 158 159 $input=158 #158=(1,96,13,13)f32 #159=(1,96,13,13)f32
nn.Conv2d                convbn2d_58              1 1 159 160 bias=True dilation=(1,1) groups=1 in_channels=96 kernel_size=(1,1) out_channels=96 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(96)f32 @weight=(96,96,1,1)f32 $input=159 #159=(1,96,13,13)f32 #160=(1,96,13,13)f32
F.relu                   F.relu_11                1 1 160 161 $input=160 #160=(1,96,13,13)f32 #161=(1,96,13,13)f32
BinaryOp                 add_1                    2 1 161 134 162 0=0 #161=(1,96,13,13)f32 #134=(1,96,13,13)f32 #162=(1,96,13,13)f32
nn.Conv2d                convbn2d_59              1 1 162 163 bias=True dilation=(1,1) groups=96 in_channels=96 kernel_size=(3,3) out_channels=96 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(96)f32 @weight=(96,1,3,3)f32 $input=162 #162=(1,96,13,13)f32 #163=(1,96,13,13)f32
F.relu                   F.relu_12                1 1 163 164 $input=163 #163=(1,96,13,13)f32 #164=(1,96,13,13)f32
pnnx.Attribute           pnnx_633                 0 1 165 @pnnx_633=(3)f32 #165=(3)f32
pnnx.Attribute           model.21.ia.0            0 1 166 @implicit=(1,96,1,1)f32 #166=(1,96,1,1)f32
Tensor.repeat            Tensor.repeat_34         1 1 166 167 sizes=(1,1,52,52) $input=166 #166=(1,96,1,1)f32 #167=(1,96,52,52)f32
BinaryOp                 add_2                    2 1 167 148 168 0=0 #167=(1,96,52,52)f32 #148=(1,96,52,52)f32 #168=(1,96,52,52)f32
nn.Conv2d                model.21.m.0             1 1 168 169 bias=True dilation=(1,1) groups=1 in_channels=96 kernel_size=(1,1) out_channels=18 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(18)f32 @weight=(18,96,1,1)f32 #168=(1,96,52,52)f32 #169=(1,18,52,52)f32
pnnx.Attribute           model.21.im.0            0 1 170 @implicit=(1,18,1,1)f32 #170=(1,18,1,1)f32
Tensor.repeat            Tensor.repeat_35         1 1 170 171 sizes=(1,1,52,52) $input=170 #170=(1,18,1,1)f32 #171=(1,18,52,52)f32
BinaryOp                 mul_3                    2 1 171 169 172 0=2 #171=(1,18,52,52)f32 #169=(1,18,52,52)f32 #172=(1,18,52,52)f32
nn.Conv2d                model.21.m_kpt.0         1 1 148 173 bias=True dilation=(1,1) groups=1 in_channels=96 kernel_size=(1,1) out_channels=45 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(45)f32 @weight=(45,96,1,1)f32 #148=(1,96,52,52)f32 #173=(1,45,52,52)f32
torch.cat                torch.cat_159            2 1 172 173 174 dim=1 #172=(1,18,52,52)f32 #173=(1,45,52,52)f32 #174=(1,63,52,52)f32
Tensor.view              Tensor.view_119          1 1 174 175 shape=(1,3,21,52,52) $input=174 #174=(1,63,52,52)f32 #175=(1,3,21,52,52)f32
torch.permute            torch.permute_180        1 1 175 176 dims=(0,1,3,4,2) $input=175 #175=(1,3,21,52,52)f32 #176=(1,3,52,52,21)f32
torch.tensor_split       slice_0                  1 2 176 177 178 dim=4 indices=(6) #176=(1,3,52,52,21)f32 #177=(1,3,52,52,6)f32 #178=(1,3,52,52,15)f32
F.sigmoid                F.sigmoid_14             1 1 177 179 $input=177 #177=(1,3,52,52,6)f32 #179=(1,3,52,52,6)f32
Tensor.view              Tensor.view_120          1 1 179 180 shape=(1,3,-1,6) $input=179 #179=(1,3,52,52,6)f32 #180=(1,3,2704,6)f32
pnnx.Attribute           pnnx_fold_grid_i_seq.1   0 1 181 @pnnx_fold_grid_i_seq.1=(1,1,2704,2)f32 #181=(1,1,2704,2)f32
Tensor.select            Tensor.select_49         1 1 165 182 dim=0 index=0 $input=165 #165=(3)f32
torch.tensor_split       slice_3                  1 3 180 183 184 185 dim=3 indices=(2,4) #180=(1,3,2704,6)f32 #183=(1,3,2704,2)f32 #184=(1,3,2704,2)f32 #185=(1,3,2704,2)f32
BinaryOp                 mul_4                    1 1 183 186 0=2 1=1 2=2.000000e+00 #183=(1,3,2704,2)f32
BinaryOp                 sub_5                    1 1 186 187 0=1 1=1 2=5.000000e-01
BinaryOp                 add_6                    2 1 187 181 188 0=0 #181=(1,1,2704,2)f32
BinaryOp                 mul_7                    2 1 188 182 189 0=2 #189=(1,3,2704,2)f32
pnnx.Attribute           pnnx_fold_1127           0 1 190 @pnnx_fold_1127=(1,3,1,2)f32 #190=(1,3,1,2)f32
BinaryOp                 mul_8                    1 1 184 191 0=2 1=1 2=2.000000e+00 #184=(1,3,2704,2)f32
BinaryOp                 pow_9                    1 1 191 192 0=6 1=1 2=2.000000e+00
BinaryOp                 mul_10                   2 1 192 190 193 0=2 #190=(1,3,1,2)f32 #193=(1,3,2704,2)f32
Tensor.view              Tensor.view_125          1 1 178 194 shape=(1,3,-1,15) $input=178 #178=(1,3,52,52,15)f32 #194=(1,3,2704,15)f32
pnnx.Attribute           pnnx_fold_1135           0 1 195 @pnnx_fold_1135=(1,1,2704,5)f32 #195=(1,1,2704,5)f32
pnnx.Attribute           pnnx_796                 0 1 196 @pnnx_796=(3)f32 #196=(3)f32
Tensor.select            Tensor.select_51         1 1 196 197 dim=0 index=0 $input=196 #196=(3)f32
Tensor.slice             slice_6                  1 1 194 198 dims=(3) ends=(2147483647) starts=(0) steps=(3) $input=194 #194=(1,3,2704,15)f32 #198=(1,3,2704,5)f32
BinaryOp                 mul_11                   1 1 198 199 0=2 1=1 2=2.000000e+00 #198=(1,3,2704,5)f32
BinaryOp                 sub_12                   1 1 199 200 0=1 1=1 2=5.000000e-01
BinaryOp                 add_13                   2 1 200 195 201 0=0 #195=(1,1,2704,5)f32
BinaryOp                 mul_14                   2 1 201 197 202 0=2 #202=(1,3,2704,5)f32
pnnx.Attribute           pnnx_fold_1143           0 1 203 @pnnx_fold_1143=(1,1,2704,5)f32 #203=(1,1,2704,5)f32
pnnx.Attribute           pnnx_819                 0 1 204 @pnnx_819=(3)f32 #204=(3)f32
Tensor.select            Tensor.select_52         1 1 204 205 dim=0 index=0 $input=204 #204=(3)f32
Tensor.slice             slice_7                  1 1 194 206 dims=(3) ends=(2147483647) starts=(1) steps=(3) $input=194 #194=(1,3,2704,15)f32 #206=(1,3,2704,5)f32
BinaryOp                 mul_15                   1 1 206 207 0=2 1=1 2=2.000000e+00 #206=(1,3,2704,5)f32
BinaryOp                 sub_16                   1 1 207 208 0=1 1=1 2=5.000000e-01
BinaryOp                 add_17                   2 1 208 203 209 0=0 #203=(1,1,2704,5)f32
BinaryOp                 mul_18                   2 1 209 205 210 0=2 #210=(1,3,2704,5)f32
Tensor.slice             slice_8                  1 1 194 211 dims=(3) ends=(2147483647) starts=(2) steps=(3) $input=194 #194=(1,3,2704,15)f32 #211=(1,3,2704,5)f32
F.sigmoid                F.sigmoid_15             1 1 211 212 $input=211 #211=(1,3,2704,5)f32 #212=(1,3,2704,5)f32
torch.unsqueeze          torch.unsqueeze_202      1 1 212 213 dim=-2 $input=212 #212=(1,3,2704,5)f32 #213=(1,3,2704,1,5)f32
torch.unsqueeze          torch.unsqueeze_201      1 1 210 214 dim=-2 $input=210 #210=(1,3,2704,5)f32 #214=(1,3,2704,1,5)f32
torch.unsqueeze          torch.unsqueeze_200      1 1 202 215 dim=-2 $input=202 #202=(1,3,2704,5)f32 #215=(1,3,2704,1,5)f32
torch.cat                torch.cat_160            3 1 215 214 213 216 dim=-2 #215=(1,3,2704,1,5)f32 #214=(1,3,2704,1,5)f32 #213=(1,3,2704,1,5)f32 #216=(1,3,2704,3,5)f32
torch.permute            torch.permute_181        1 1 216 217 dims=(0,1,2,4,3) $input=216 #216=(1,3,2704,3,5)f32 #217=(1,3,2704,5,3)f32
Tensor.reshape           Tensor.reshape_46        1 1 217 218 shape=(1,3,-1,15) $input=217 #217=(1,3,2704,5,3)f32 #218=(1,3,2704,15)f32
pnnx.Attribute           model.21.ia.1            0 1 219 @implicit=(1,96,1,1)f32 #219=(1,96,1,1)f32
Tensor.repeat            Tensor.repeat_38         1 1 219 220 sizes=(1,1,26,26) $input=219 #219=(1,96,1,1)f32 #220=(1,96,26,26)f32
BinaryOp                 add_19                   2 1 220 157 221 0=0 #220=(1,96,26,26)f32 #157=(1,96,26,26)f32 #221=(1,96,26,26)f32
nn.Conv2d                model.21.m.1             1 1 221 222 bias=True dilation=(1,1) groups=1 in_channels=96 kernel_size=(1,1) out_channels=18 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(18)f32 @weight=(18,96,1,1)f32 #221=(1,96,26,26)f32 #222=(1,18,26,26)f32
pnnx.Attribute           model.21.im.1            0 1 223 @implicit=(1,18,1,1)f32 #223=(1,18,1,1)f32
Tensor.repeat            Tensor.repeat_39         1 1 223 224 sizes=(1,1,26,26) $input=223 #223=(1,18,1,1)f32 #224=(1,18,26,26)f32
BinaryOp                 mul_20                   2 1 224 222 225 0=2 #224=(1,18,26,26)f32 #222=(1,18,26,26)f32 #225=(1,18,26,26)f32
nn.Conv2d                model.21.m_kpt.1         1 1 157 226 bias=True dilation=(1,1) groups=1 in_channels=96 kernel_size=(1,1) out_channels=45 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(45)f32 @weight=(45,96,1,1)f32 #157=(1,96,26,26)f32 #226=(1,45,26,26)f32
torch.cat                torch.cat_162            2 1 225 226 227 dim=1 #225=(1,18,26,26)f32 #226=(1,45,26,26)f32 #227=(1,63,26,26)f32
Tensor.view              Tensor.view_127          1 1 227 228 shape=(1,3,21,26,26) $input=227 #227=(1,63,26,26)f32 #228=(1,3,21,26,26)f32
torch.permute            torch.permute_182        1 1 228 229 dims=(0,1,3,4,2) $input=228 #228=(1,3,21,26,26)f32 #229=(1,3,26,26,21)f32
torch.tensor_split       slice_10                 1 2 229 230 231 dim=4 indices=(6) #229=(1,3,26,26,21)f32 #230=(1,3,26,26,6)f32 #231=(1,3,26,26,15)f32
F.sigmoid                F.sigmoid_16             1 1 230 232 $input=230 #230=(1,3,26,26,6)f32 #232=(1,3,26,26,6)f32
Tensor.view              Tensor.view_128          1 1 232 233 shape=(1,3,-1,6) $input=232 #232=(1,3,26,26,6)f32 #233=(1,3,676,6)f32
pnnx.Attribute           pnnx_fold_grid_i_seq0.1  0 1 234 @pnnx_fold_grid_i_seq0.1=(1,1,676,2)f32 #234=(1,1,676,2)f32
pnnx.Attribute           pnnx_977                 0 1 235 @pnnx_977=(3)f32 #235=(3)f32
Tensor.select            Tensor.select_53         1 1 235 236 dim=0 index=1 $input=235 #235=(3)f32
torch.tensor_split       slice_13                 1 3 233 237 238 239 dim=3 indices=(2,4) #233=(1,3,676,6)f32 #237=(1,3,676,2)f32 #238=(1,3,676,2)f32 #239=(1,3,676,2)f32
BinaryOp                 mul_21                   1 1 237 240 0=2 1=1 2=2.000000e+00 #237=(1,3,676,2)f32
BinaryOp                 sub_22                   1 1 240 241 0=1 1=1 2=5.000000e-01
BinaryOp                 add_23                   2 1 241 234 242 0=0 #234=(1,1,676,2)f32
BinaryOp                 mul_24                   2 1 242 236 243 0=2 #243=(1,3,676,2)f32
pnnx.Attribute           pnnx_fold_1234           0 1 244 @pnnx_fold_1234=(1,3,1,2)f32 #244=(1,3,1,2)f32
BinaryOp                 mul_25                   1 1 238 245 0=2 1=1 2=2.000000e+00 #238=(1,3,676,2)f32
BinaryOp                 pow_26                   1 1 245 246 0=6 1=1 2=2.000000e+00
BinaryOp                 mul_27                   2 1 246 244 247 0=2 #244=(1,3,1,2)f32 #247=(1,3,676,2)f32
Tensor.view              Tensor.view_133          1 1 231 248 shape=(1,3,-1,15) $input=231 #231=(1,3,26,26,15)f32 #248=(1,3,676,15)f32
pnnx.Attribute           pnnx_fold_1242           0 1 249 @pnnx_fold_1242=(1,1,676,5)f32 #249=(1,1,676,5)f32
pnnx.Attribute           pnnx_1024                0 1 250 @pnnx_1024=(3)f32 #250=(3)f32
Tensor.select            Tensor.select_55         1 1 250 251 dim=0 index=1 $input=250 #250=(3)f32
Tensor.slice             slice_16                 1 1 248 252 dims=(3) ends=(2147483647) starts=(0) steps=(3) $input=248 #248=(1,3,676,15)f32 #252=(1,3,676,5)f32
BinaryOp                 mul_28                   1 1 252 253 0=2 1=1 2=2.000000e+00 #252=(1,3,676,5)f32
BinaryOp                 sub_29                   1 1 253 254 0=1 1=1 2=5.000000e-01
BinaryOp                 add_30                   2 1 254 249 255 0=0 #249=(1,1,676,5)f32
BinaryOp                 mul_31                   2 1 255 251 256 0=2 #256=(1,3,676,5)f32
pnnx.Attribute           pnnx_fold_1250           0 1 257 @pnnx_fold_1250=(1,1,676,5)f32 #257=(1,1,676,5)f32
pnnx.Attribute           pnnx_1047                0 1 258 @pnnx_1047=(3)f32 #258=(3)f32
Tensor.select            Tensor.select_56         1 1 258 259 dim=0 index=1 $input=258 #258=(3)f32
Tensor.slice             slice_17                 1 1 248 260 dims=(3) ends=(2147483647) starts=(1) steps=(3) $input=248 #248=(1,3,676,15)f32 #260=(1,3,676,5)f32
BinaryOp                 mul_32                   1 1 260 261 0=2 1=1 2=2.000000e+00 #260=(1,3,676,5)f32
BinaryOp                 sub_33                   1 1 261 262 0=1 1=1 2=5.000000e-01
BinaryOp                 add_34                   2 1 262 257 263 0=0 #257=(1,1,676,5)f32
BinaryOp                 mul_35                   2 1 263 259 264 0=2 #264=(1,3,676,5)f32
Tensor.slice             slice_18                 1 1 248 265 dims=(3) ends=(2147483647) starts=(2) steps=(3) $input=248 #248=(1,3,676,15)f32 #265=(1,3,676,5)f32
F.sigmoid                F.sigmoid_17             1 1 265 266 $input=265 #265=(1,3,676,5)f32 #266=(1,3,676,5)f32
torch.unsqueeze          torch.unsqueeze_205      1 1 266 267 dim=-2 $input=266 #266=(1,3,676,5)f32 #267=(1,3,676,1,5)f32
torch.unsqueeze          torch.unsqueeze_204      1 1 264 268 dim=-2 $input=264 #264=(1,3,676,5)f32 #268=(1,3,676,1,5)f32
torch.unsqueeze          torch.unsqueeze_203      1 1 256 269 dim=-2 $input=256 #256=(1,3,676,5)f32 #269=(1,3,676,1,5)f32
torch.cat                torch.cat_163            3 1 269 268 267 270 dim=-2 #269=(1,3,676,1,5)f32 #268=(1,3,676,1,5)f32 #267=(1,3,676,1,5)f32 #270=(1,3,676,3,5)f32
torch.permute            torch.permute_183        1 1 270 271 dims=(0,1,2,4,3) $input=270 #270=(1,3,676,3,5)f32 #271=(1,3,676,5,3)f32
Tensor.reshape           Tensor.reshape_47        1 1 271 272 shape=(1,3,-1,15) $input=271 #271=(1,3,676,5,3)f32 #272=(1,3,676,15)f32
pnnx.Attribute           model.21.ia.2            0 1 273 @implicit=(1,96,1,1)f32 #273=(1,96,1,1)f32
nn.Conv2d                convbn2d_60              1 1 164 274 bias=True dilation=(1,1) groups=1 in_channels=96 kernel_size=(1,1) out_channels=96 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(96)f32 @weight=(96,96,1,1)f32 $input=164 #164=(1,96,13,13)f32 #274=(1,96,13,13)f32
F.relu                   F.relu_13                1 1 274 275 $input=274 #274=(1,96,13,13)f32 #275=(1,96,13,13)f32
Tensor.repeat            Tensor.repeat_42         1 1 273 276 sizes=(1,1,13,13) $input=273 #273=(1,96,1,1)f32 #276=(1,96,13,13)f32
BinaryOp                 add_36                   2 1 276 275 277 0=0 #276=(1,96,13,13)f32 #275=(1,96,13,13)f32 #277=(1,96,13,13)f32
nn.Conv2d                model.21.m.2             1 1 277 278 bias=True dilation=(1,1) groups=1 in_channels=96 kernel_size=(1,1) out_channels=18 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(18)f32 @weight=(18,96,1,1)f32 #277=(1,96,13,13)f32 #278=(1,18,13,13)f32
pnnx.Attribute           model.21.im.2            0 1 279 @implicit=(1,18,1,1)f32 #279=(1,18,1,1)f32
Tensor.repeat            Tensor.repeat_43         1 1 279 280 sizes=(1,1,13,13) $input=279 #279=(1,18,1,1)f32 #280=(1,18,13,13)f32
BinaryOp                 mul_37                   2 1 280 278 281 0=2 #280=(1,18,13,13)f32 #278=(1,18,13,13)f32 #281=(1,18,13,13)f32
nn.Conv2d                model.21.m_kpt.2         1 1 275 282 bias=True dilation=(1,1) groups=1 in_channels=96 kernel_size=(1,1) out_channels=45 padding=(0,0) padding_mode=zeros stride=(1,1) @bias=(45)f32 @weight=(45,96,1,1)f32 #275=(1,96,13,13)f32 #282=(1,45,13,13)f32
torch.cat                torch.cat_165            2 1 281 282 283 dim=1 #281=(1,18,13,13)f32 #282=(1,45,13,13)f32 #283=(1,63,13,13)f32
Tensor.view              Tensor.view_135          1 1 283 284 shape=(1,3,21,13,13) $input=283 #283=(1,63,13,13)f32 #284=(1,3,21,13,13)f32
torch.permute            torch.permute_184        1 1 284 285 dims=(0,1,3,4,2) $input=284 #284=(1,3,21,13,13)f32 #285=(1,3,13,13,21)f32
torch.tensor_split       slice_20                 1 2 285 286 287 dim=4 indices=(6) #285=(1,3,13,13,21)f32 #286=(1,3,13,13,6)f32 #287=(1,3,13,13,15)f32
F.sigmoid                F.sigmoid_18             1 1 286 288 $input=286 #286=(1,3,13,13,6)f32 #288=(1,3,13,13,6)f32
Tensor.view              Tensor.view_136          1 1 288 289 shape=(1,3,-1,6) $input=288 #288=(1,3,13,13,6)f32 #289=(1,3,169,6)f32
pnnx.Attribute           pnnx_fold_grid_i_seq1.1  0 1 290 @pnnx_fold_grid_i_seq1.1=(1,1,169,2)f32 #290=(1,1,169,2)f32
pnnx.Attribute           pnnx_1206                0 1 291 @pnnx_1206=(3)f32 #291=(3)f32
Tensor.select            Tensor.select_57         1 1 291 292 dim=0 index=2 $input=291 #291=(3)f32
torch.tensor_split       slice_23                 1 3 289 293 294 295 dim=3 indices=(2,4) #289=(1,3,169,6)f32 #293=(1,3,169,2)f32 #294=(1,3,169,2)f32 #295=(1,3,169,2)f32
BinaryOp                 mul_38                   1 1 293 296 0=2 1=1 2=2.000000e+00 #293=(1,3,169,2)f32
BinaryOp                 sub_39                   1 1 296 297 0=1 1=1 2=5.000000e-01
BinaryOp                 add_40                   2 1 297 290 298 0=0 #290=(1,1,169,2)f32
BinaryOp                 mul_41                   2 1 298 292 299 0=2 #299=(1,3,169,2)f32
pnnx.Attribute           pnnx_fold_1341           0 1 300 @pnnx_fold_1341=(1,3,1,2)f32 #300=(1,3,1,2)f32
BinaryOp                 mul_42                   1 1 294 301 0=2 1=1 2=2.000000e+00 #294=(1,3,169,2)f32
BinaryOp                 pow_43                   1 1 301 302 0=6 1=1 2=2.000000e+00
BinaryOp                 mul_44                   2 1 302 300 303 0=2 #300=(1,3,1,2)f32 #303=(1,3,169,2)f32
Tensor.view              Tensor.view_141          1 1 287 304 shape=(1,3,-1,15) $input=287 #287=(1,3,13,13,15)f32 #304=(1,3,169,15)f32
pnnx.Attribute           pnnx_fold_1349           0 1 305 @pnnx_fold_1349=(1,1,169,5)f32 #305=(1,1,169,5)f32
pnnx.Attribute           pnnx_1253                0 1 306 @pnnx_1253=(3)f32 #306=(3)f32
Tensor.select            Tensor.select_59         1 1 306 307 dim=0 index=2 $input=306 #306=(3)f32
Tensor.slice             slice_26                 1 1 304 308 dims=(3) ends=(2147483647) starts=(0) steps=(3) $input=304 #304=(1,3,169,15)f32 #308=(1,3,169,5)f32
BinaryOp                 mul_45                   1 1 308 309 0=2 1=1 2=2.000000e+00 #308=(1,3,169,5)f32
BinaryOp                 sub_46                   1 1 309 310 0=1 1=1 2=5.000000e-01
BinaryOp                 add_47                   2 1 310 305 311 0=0 #305=(1,1,169,5)f32
BinaryOp                 mul_48                   2 1 311 307 312 0=2 #312=(1,3,169,5)f32
pnnx.Attribute           pnnx_fold_1357           0 1 313 @pnnx_fold_1357=(1,1,169,5)f32 #313=(1,1,169,5)f32
pnnx.Attribute           pnnx_1276                0 1 314 @pnnx_1276=(3)f32 #314=(3)f32
Tensor.select            Tensor.select_60         1 1 314 315 dim=0 index=2 $input=314 #314=(3)f32
Tensor.slice             slice_27                 1 1 304 316 dims=(3) ends=(2147483647) starts=(1) steps=(3) $input=304 #304=(1,3,169,15)f32 #316=(1,3,169,5)f32
BinaryOp                 mul_49                   1 1 316 317 0=2 1=1 2=2.000000e+00 #316=(1,3,169,5)f32
BinaryOp                 sub_50                   1 1 317 318 0=1 1=1 2=5.000000e-01
BinaryOp                 add_51                   2 1 318 313 319 0=0 #313=(1,1,169,5)f32
BinaryOp                 mul_52                   2 1 319 315 320 0=2 #320=(1,3,169,5)f32
Tensor.slice             slice_28                 1 1 304 321 dims=(3) ends=(2147483647) starts=(2) steps=(3) $input=304 #304=(1,3,169,15)f32 #321=(1,3,169,5)f32
F.sigmoid                F.sigmoid_19             1 1 321 322 $input=321 #321=(1,3,169,5)f32 #322=(1,3,169,5)f32
torch.unsqueeze          torch.unsqueeze_208      1 1 322 323 dim=-2 $input=322 #322=(1,3,169,5)f32 #323=(1,3,169,1,5)f32
torch.unsqueeze          torch.unsqueeze_207      1 1 320 324 dim=-2 $input=320 #320=(1,3,169,5)f32 #324=(1,3,169,1,5)f32
torch.unsqueeze          torch.unsqueeze_206      1 1 312 325 dim=-2 $input=312 #312=(1,3,169,5)f32 #325=(1,3,169,1,5)f32
torch.cat                torch.cat_166            3 1 325 324 323 326 dim=-2 #325=(1,3,169,1,5)f32 #324=(1,3,169,1,5)f32 #323=(1,3,169,1,5)f32 #326=(1,3,169,3,5)f32
torch.permute            torch.permute_185        1 1 326 327 dims=(0,1,2,4,3) $input=326 #326=(1,3,169,3,5)f32 #327=(1,3,169,5,3)f32
Tensor.reshape           Tensor.reshape_48        1 1 327 328 shape=(1,3,-1,15) $input=327 #327=(1,3,169,5,3)f32 #328=(1,3,169,15)f32
torch.cat                torch.cat_167            4 1 299 303 295 328 329 dim=-1 #299=(1,3,169,2)f32 #303=(1,3,169,2)f32 #295=(1,3,169,2)f32 #328=(1,3,169,15)f32 #329=(1,3,169,21)f32
Tensor.view              Tensor.view_142          1 1 329 330 shape=(1,-1,21) $input=329 #329=(1,3,169,21)f32 #330=(1,507,21)f32
torch.cat                torch.cat_164            4 1 243 247 239 272 331 dim=-1 #243=(1,3,676,2)f32 #247=(1,3,676,2)f32 #239=(1,3,676,2)f32 #272=(1,3,676,15)f32 #331=(1,3,676,21)f32
Tensor.view              Tensor.view_134          1 1 331 332 shape=(1,-1,21) $input=331 #331=(1,3,676,21)f32 #332=(1,2028,21)f32
torch.cat                torch.cat_161            4 1 189 193 185 218 333 dim=-1 #189=(1,3,2704,2)f32 #193=(1,3,2704,2)f32 #185=(1,3,2704,2)f32 #218=(1,3,2704,15)f32 #333=(1,3,2704,21)f32
Tensor.view              Tensor.view_126          1 1 333 334 shape=(1,-1,21) $input=333 #333=(1,3,2704,21)f32 #334=(1,8112,21)f32
torch.cat                torch.cat_168            3 1 334 332 330 335 dim=1 #334=(1,8112,21)f32 #332=(1,2028,21)f32 #330=(1,507,21)f32 #335=(1,10647,21)f32
pnnx.Output              pnnx_output_0            1 0 335 #335=(1,10647,21)f32
